#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<string.h>
#include<stdlib.h>
#define MAX 10
#define WIDTH 1

int al[10][5][3] = {
	{
		{' ', '-', ' '}, {'|', ' ', '|'}, {' ', ' ', ' '}, {'|', ' ', '|'}, {' ', '-', ' '}//0
	},
	{
		{' ', ' ', ' '}, {' ', ' ', '|'}, {' ', ' ', ' '}, {' ', ' ', '|'}, {' ', ' ', ' '}//1
	},
	{
		{' ', '-', ' '}, {' ', ' ', '|'}, {' ', '-', ' '}, {'|', ' ', ' '}, {' ', '-', ' '}//2
	},
	{
		{' ', '-', ' '}, {' ', ' ', '|'}, {' ', '-', ' '}, {' ', ' ', '|'}, {' ', '-', ' '}//3
	},
	{
		{' ', ' ', ' '}, {'|', ' ', '|'}, {' ', '-', ' '}, {' ', ' ', '|'}, {' ', ' ', ' '}//4
	},
	{
		{' ', '-', ' '}, {'|', ' ', ' '}, {' ', '-', ' '}, {' ', ' ', '|'}, {' ', '-', ' '}//5
	},
	{
		{' ', '-', ' '}, {'|', ' ', ' '}, {' ', '-', ' '}, {'|', ' ', '|'}, {' ', '-', ' '}//6
	},
	{
		{' ', '-', ' '}, {'|', ' ', '|'}, {' ', ' ', ' '}, {' ', ' ', '|'}, {' ', ' ', ' '}//7
	},
	{
		{' ', '-', ' '}, {'|', ' ', '|'}, {' ', '-', ' '}, {'|', ' ', '|'}, {' ', '-', ' '}//8
	},
	{
		{' ', '-', ' '}, {'|', ' ', '|'}, {' ', '-', ' '}, {' ', ' ', '|'}, {' ', '-', ' '}//9
	}
};

int main2()
{
	int n[MAX], width, tmp, flag = 0;
	char ch;
	int i, j, k, num = 0;

	printf("请输入要打印的数字(包括空格最多%d个)：", MAX);
	while(num != MAX && ((n[num] = getchar() - '0') != '\n' - '0'))
	{
		num++;
	}
	while (num == MAX && (ch = getchar()) != '\n')//处理剩余字符
	{
		printf("丢弃%c\n", ch);
	}

	for (j = 0, width = WIDTH; j < 5; j++)
	{
	begin:
		for (i = 0; i < num; i++)
		{
			if (n[i] == ' ' - '0')
			{
				printf("   ");
				continue;
			}
			
			for (k = 0; k < 3; k++)
			{
				putchar(al[n[i]][j][k]);
				for (tmp = WIDTH; tmp != 1 && k == 1; )
				{
					tmp--;
					putchar(al[n[i]][j][k]);
				}
			}
		}
		putchar('\n');
		if (flag == 0)
		{
			width = WIDTH;
		}
		else
		{

		}
		for(; j % 2 == 1 && width != 1; )
		{
			width--;
			flag = 1;
			goto begin;
		}
		width = WIDTH;
		flag = 0;
	}

	system("pause");
	return 0;
}

